In [3]:
import pandas as pd
import numpy as np
from sklearn.impute import SimpleImputer

In [4]:
data=pd.read_csv(r"C:\Users\admin\Desktop\Pandas\senapati sir\PART-1- CLASS WORK\Data.csv")

In [5]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [12]:
si=SimpleImputer(missing_values=np.nan,strategy="mean")

In [7]:
si

SimpleImputer()

In [14]:
si=si.fit(data)

ValueError: Cannot use mean strategy with non-numeric data:
could not convert string to float: 'France'

In [15]:
from sklearn.preprocessing import OneHotEncoder

In [16]:
ohe=OneHotEncoder()

In [17]:
ohe

OneHotEncoder()

In [19]:
ohe.fit(data[["Country"]])

OneHotEncoder()

In [23]:
ary1=ohe.transform(data[["Country"]]).toarray()

In [24]:
ary1

array([[1., 0., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [0., 0., 1.],
       [0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [1., 0., 0.],
       [0., 1., 0.],
       [1., 0., 0.]])

In [31]:
encode=pd.DataFrame(ary1,columns=["France","Germany","Spain"])

In [33]:
data1=pd.concat([encode,data],axis=1)

In [34]:
data1

   France  Germany  Spain  Country   Age   Salary Purchased
0     1.0      0.0    0.0   France  44.0  72000.0        No
1     0.0      0.0    1.0    Spain  27.0  48000.0       Yes
2     0.0      1.0    0.0  Germany  30.0  54000.0        No
3     0.0      0.0    1.0    Spain  38.0  61000.0        No
4     0.0      1.0    0.0  Germany  40.0      NaN       Yes
5     1.0      0.0    0.0   France  35.0  58000.0       Yes
6     0.0      0.0    1.0    Spain   NaN  52000.0        No
7     1.0      0.0    0.0   France  48.0  79000.0       Yes
8     0.0      1.0    0.0  Germany  50.0  83000.0        No
9     1.0      0.0    0.0   France  37.0  67000.0       Yes

In [36]:
data1.drop("Spain",axis=1,inplace=True)

In [37]:
data1.drop("Country",axis=1,inplace=True)

In [38]:
data1

   France  Germany   Age   Salary Purchased
0     1.0      0.0  44.0  72000.0        No
1     0.0      0.0  27.0  48000.0       Yes
2     0.0      1.0  30.0  54000.0        No
3     0.0      0.0  38.0  61000.0        No
4     0.0      1.0  40.0      NaN       Yes
5     1.0      0.0  35.0  58000.0       Yes
6     0.0      0.0   NaN  52000.0        No
7     1.0      0.0  48.0  79000.0       Yes
8     0.0      1.0  50.0  83000.0        No
9     1.0      0.0  37.0  67000.0       Yes

In [41]:
from sklearn.model_selection import train_test_split

In [42]:
X=data1.drop("Purchased",axis=1)

In [43]:
X

   France  Germany   Age   Salary
0     1.0      0.0  44.0  72000.0
1     0.0      0.0  27.0  48000.0
2     0.0      1.0  30.0  54000.0
3     0.0      0.0  38.0  61000.0
4     0.0      1.0  40.0      NaN
5     1.0      0.0  35.0  58000.0
6     0.0      0.0   NaN  52000.0
7     1.0      0.0  48.0  79000.0
8     0.0      1.0  50.0  83000.0
9     1.0      0.0  37.0  67000.0

In [46]:
y=data1[["Purchased"]]

In [47]:
y

  Purchased
0        No
1       Yes
2        No
3        No
4       Yes
5       Yes
6        No
7       Yes
8        No
9       Yes

In [65]:
Xtrain,Xtest,ytrain,ytest=train_test_split(X,y,test_size=0.10)

In [66]:
Xtrain

   France  Germany   Age   Salary
2     0.0      1.0  30.0  54000.0
9     1.0      0.0  37.0  67000.0
1     0.0      0.0  27.0  48000.0
7     1.0      0.0  48.0  79000.0
0     1.0      0.0  44.0  72000.0
4     0.0      1.0  40.0      NaN
8     0.0      1.0  50.0  83000.0
5     1.0      0.0  35.0  58000.0
3     0.0      0.0  38.0  61000.0

In [67]:
ytrain

  Purchased
2        No
9       Yes
1       Yes
7       Yes
0        No
4       Yes
8        No
5       Yes
3        No

In [68]:
si.fit(X)

SimpleImputer()

In [69]:
data1=si.transform(X)

In [70]:
final=pd.DataFrame(data1)

In [71]:
final

     0    1          2             3
0  1.0  0.0  44.000000  72000.000000
1  0.0  0.0  27.000000  48000.000000
2  0.0  1.0  30.000000  54000.000000
3  0.0  0.0  38.000000  61000.000000
4  0.0  1.0  40.000000  63777.777778
5  1.0  0.0  35.000000  58000.000000
6  0.0  0.0  38.777778  52000.000000
7  1.0  0.0  48.000000  79000.000000
8  0.0  1.0  50.000000  83000.000000
9  1.0  0.0  37.000000  67000.000000

In [72]:
from sklearn.linear_model import LogisticRegression

In [73]:
lr=LogisticRegression()
lr

LogisticRegression()

In [76]:
lr.fit(final,ytrain)

C:\Users\admin\anaconda3\lib\site-packages\sklearn\utils\validation.py:63: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  return f(*args, **kwargs)

ValueError: Found input variables with inconsistent numbers of samples: [10, 9]

ModuleNotFoundError: No module named 'pandas.tools'